<a href="https://colab.research.google.com/github/maithstartup/Notebooks-Practical-ML-Beginners/blob/master/pandas/pandas_concat_append.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Combining DataFrame using Concat and Append

## <font color='blue'>Basic Concatenation</font>

In [2]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [4]:
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## <font color='blue'>Ignore Index</font>

In [5]:
df = pd.concat([india_weather, us_weather], ignore_index=True )
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

## <font color='blue'>Concatenation And Keys</font>

In [6]:
df = pd.concat([india_weather, us_weather], keys=["india", "us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [7]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [8]:
df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

## <font color='blue'>Concatenation Using Index</font>

In [9]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [17]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
},index=[1,0] )
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [18]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [12]:
df = pd.concat([temperature_df,windspeed_df],axis=1,join="inner")
df

     city  temperature    city  windspeed
0  mumbai           32  mumbai         12
1   delhi           45   delhi          7

## <font color='blue'>Concatenate dataframe with series</font>

In [13]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [14]:
df = pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain

Append rows of other to the end of caller, returning a new object.

Columns in other that are not in the caller are added as new columns.

In [21]:
df2=india_weather.append(us_weather,ignore_index=True)

In [22]:
df2

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [24]:
tn_weather = pd.DataFrame({
    "city": ["Chennai","Coimbatore","Madurai"],
    "temperature": [21,14,35],
    "rainfall": [60, 165, 75]
})

In [25]:
df2.append(tn_weather,ignore_index=True)

         city  temperature  humidity  rainfall
0      mumbai           32      80.0       NaN
1       delhi           45      60.0       NaN
2    banglore           30      78.0       NaN
3    new york           21      68.0       NaN
4     chicago           14      65.0       NaN
5     orlando           35      75.0       NaN
6     Chennai           21       NaN      60.0
7  Coimbatore           14       NaN     165.0
8     Madurai           35       NaN      75.0